[
  {
    "blogImage": "images/blog/blogCovers003.jpg",
    "blogTitle": "Pragmatic UX for Service Industry",
	"blogSubTitle": "Similar to quick service restuarants, IT service sector has been focusing on quick and demand based services. It’s been talked a lot whether IT services should focus on the usability and the overall user experience of the product for end-users. Lets explore it to get to know to some interesting facts.",
	"blogPostDate":"Oct 11, 2015",
	"blogPostTag":"Opinions",
    "blogDetailDescription":"<div class=post-img><img class=img-responsive alt=\"\" src=images/blog/blogCovers003.jpg style=\"margin:0 auto\"><\/div><div class=post-content><p>The relevance of UX is well understood and realized easily in case of product based companies, because its very clearly communicated whether something works or not. However, in service industry its not always communicated back whether something really worked or not.<\/p><blockquote>To understand the whole ecosystem and facilitate a solution for highly agile situations ‘Pragmatic UX for Services’ has been concieved. It incorporates the follwoing characteristics and ensures the better quality of the product with guaranteed added values from UX perspective.<ul><li>Quick &amp; Iterative<\/li><li>Collaborative in Nature (Virtual Collaboration can also be encouraged)<\/li><li>Process - Oriented<\/li><li>As per Contemporary Standards &amp; Practices<\/li><\/ul><\/blockquote><p>Pragmatic UX for Services is a framework with set of activities which defines the design solution plan beforehand and drive the process quickly in collaboration with other teams. It follows this three step model as -<\/p><ol><li>Ideate<\/li><li>Narrow down ideas on validation<\/li><li>Build<\/li><\/ol><p>The set of activities for different phases of design process has been well curated to be accomplished faster and stay focussed towards the context of design. These activities are innovative, new and fun-filed to create innovative ux patterns and ideas.<\/p><\/div>"
  },
  {
    "blogImage": "images/blog/DataViz.jpg",
    "blogTitle": "Data Visualization : UX INDIA 2014",
	"blogSubTitle": "There was an era of manufacturing boom during renaissance period. That era was known as atomic age. During those times, atoms were considered to be the most fundamental particles, which everything is made of.",
	"blogPostDate":"Dec 11, 2014",
	"blogPostTag":"Principles,How To's, Talks",
    "blogDetailDescription":"<div><iframe width=1140 height=480 src=\"https://www.youtube.com/embed/61kYV_naCho?rel=0&amp;controls=0&amp;showinfo=0\" frameborder=0 allowfullscreen><\/iframe><\/div>"
  },
  {
    "blogImage": "images/blog/Material_Design01.jpg",
    "blogTitle": "Material Design",
	"blogSubTitle": "Material Design incorporates the principles of design and science to set a new framework for designing a unified experience across devices and platforms. Material design is all about - making it obvious, making it bold & making it work everywhere.",
	"blogPostDate":"Sep 29, 2015",
	"blogPostTag":"Principles,How To's",
    "blogDetailDescription":"<div class=post-img><img class=img-responsive alt=\"\" src=images/blog/Material_Design01.jpg style=\"margin:0 auto\"><\/div><div class=post-content><p>A new design language, by Google, which uniquely combines the principles of design and science to create a unified and pleasant interactive experience. To understand the gist of material design please read the document - <a href=resources/MaterialDesign.pdf target=_blank>Material Design in 5 Slides<\/a><\/p><\/div>"
  },
  {
    "blogImage": "images/blog/Elastic_Users01.jpg",
    "blogTitle": "Elastic Users : WAY to Personas",
	"blogSubTitle": "Have you ever encountered with these kind of questions while presenting your design to the customer or the development team – \"What will happen if the user wouldn’t like to do this task and instead the other task which is missing in the design…\" If you have come across questions similar to this, then please read on to find how to avoid the root cause of these situations.",
	"blogPostDate":"Aug 13, 2015",
	"blogPostTag":"Principles,How To's",
    "blogDetailDescription":"<div class=post-img><img class=img-responsive alt=\"\" src=images/blog/Elastic_Users01.jpg style=\"margin:0 auto\"><\/div><div class=post-content><p>These questions, most probably happen to be the edge-cases - in technology terms. These are the situations that might possibly happen, but usually won’t for the target set of users. Goal-driven designs follow a process, in which user-archetypes are defined quite before plunging into designing. User archetypes are useful to understand the needs, goals and tasks of the real users. These user-archetypes are defined using the data insights found from the different sets of research activities accomplished on the real users. The user-archetypes, typically include all the behavioral attributes of most of the users and in fact represent a large section of users. The personification of the user-archetypes is done and given all the physical attributes of a real user such as name, age, profession et al. This user-archetype is called persona. It’s always quite imperative to refer to a persona by its name, so as to be in the closest proximity to the users’ needs and goals naturally. Now, the designer starts thinking in the shoes of that persona. So, there are the situations that might possibly happen, but usually won’t for the target persona. That is why the goal-driven design has not considered those cases in the particular context.<\/p>The teams, which are unaware of these activities behind the scene, think around the complete set of users and find some cases unattended in the design. We have seen that in a team discussion, we tend to use the term ‘user’, to discuss the tasks and the flows etc. This is a common phenomenon practiced by all the participants of the team, which are from varied backgrounds. The term ‘user’ is too broad to cover all possible situations and needs. One team-member talks about the needs of a ‘user’, while another team-member talks about the other needs of a ‘user’; everyone talks about the needs of the ‘user’ from his perspective. The astonishing fact about this discussion is, while that the team-members are talking about the ‘user’, which is a replica of the users’ perception in multiple scenarios in their minds. These are not the real users who, represent a large set of users in that particular context. In this way we can have ( or conjure) as many different kinds of users as many participants are or even more than that. With so many user representatives existing in the minds of team members, we can not build a consensus on user needs and it will lead to a stalemate. Thus, stretching the term ‘user’ to refer to a wide variety of users brings the elasticity in the term ‘user’, and so the participants stretch it and mold it as per their perspectives. This ‘user’ term is referred as Elastic User. The communication language for all the participants use the term ‘user’ to refer to the current user of the product/system, which we refer to as elastic user. Designing for the elastic user gives a product development team freedom to build what it pleases, while still apparently serving “the user.”<p>To get rid of such situations we take help of the findings of the user-research, and create a user-archetype to serve the purpose of non-elastic realistic user referred as persona. A meticulous examination and analysis of the research findings is carried out and the behavioral attributes of the real users are identified. Along with that, the different other attributes of the users pertaining to the use of the product can be determined. The users are mapped to those attributes with a logical precision. Here logical precision tells that, the user need not to be quantitatively mapped exactly to the attributes, rather a comparative mapping can be done.<\/p><p>Let’s take an example to understand this. A sample user John is found to be fond of latest technology devices like iPhone, MacBook, Google glass and a Raspberry Pi. Another guy Fredrick has been found to be content with an iPhone 5s and a MacBook Pro. In contrast, a sales manager Michelle has one PC which she uses only for official works and an iPhone 4.<\/p><img class=img-responsive src=images/blog/Elastic_Users02.jpg style=\"margin:0 auto\"><p>In order to map these users on a technology-friendly parameter, say gadget-loving, we can have a scale with two ends – technophile and technophobic. John can be mapped to extreme end of technophile and Fredrick can be mapped little close to John but more towards the center. While, Michelle can be mapped little close towards technophobic end. So, this kind of attribute mapping is always relative in nature rather than precisely quantitative. This is what logical precision means. Similarly, all the users under the study and the research are mapped to create a pattern. This evolving pattern of coming out of the mapping represents a behavior pattern for most of the users. The patterns, which cover around 8 users can be identified to be grouped under a persona. In this way, we create personas, which represent a large group of users in terms of their needs, behaviors and goals.<\/p><p>In order to have a conclusive discussion, all the team members should be exposed to the personas developed by the time. The importance of personas can be illustrated in the office wall for public display or it can be explained in a quick discussion before a decision-meet. The small but significant notable point here is, to refer the user by the name of the persona while explaining a persona-based scenario is equally important. It’s always important to note while practicing a UX-process that we should avoid two common mistakes –<\/p><ul><li>Conflating different situations in different contexts<\/li><li>Referring to the large set of users with the term ‘user’<\/li><\/ul>Practices to follow for a directive discussion without unnecessary digression are -<ul><li>Talk about persona before a design decision meet<\/li><li>Call user with a named Persona in a context as per the scenario<\/li><li>Drive the discussion only on the lines of scenario.<\/li><li>Emphasize the team to think in the shoes of the personas rather than having a preconceived set of users in their minds.<\/li><li>Do not confine the persona with excess situational constraints so as to welcome the myriads perspectives and ideas from the participants.<\/li><li>Edge cases must be designed and programmed for, but they should never be the design focus.<\/li><\/ul>•<p>In Summary, Real users can be better understood using personas, which are defined on exhaustive research findings and ‘these personas in a scenario’ should be used to drive the discussion so as to reach at a conclusive point.<\/p><\/div>"
  },
  {
    "blogImage": "images/blog/Storyboarding001.jpg",
    "blogTitle": "Storyboarding in UX Design",
	"blogSubTitle": "Storyboard is a sequence of images to depict a scenario and communicate the idea effectively. It helps others understand the concept and facilitates a better ground for creative thinking.",
	"blogPostDate":"Aug 11, 2015",
	"blogPostTag":"Opinions,Principles",
    "blogDetailDescription":"<div class=post-img><img class=img-responsive alt=\"\" src=images/blog/Storyboarding001.jpg style=\"margin:0 auto;box-shadow:0 0 5px #888\"><\/div><div class=post-content><p><br>The Walt Disney studio is widely known for popularising the storyboarding since 1920s. Storyboards have always been a crucial part of movie making process. Many studios such as Pixar rely heavily on storyboards for concept making rather than scripts.<br>Stories stimulate our thinking cells and helps us think in different dimensions. It makes people bound to get immersed into the scenes and situations to bring them more closer to the matter and its central idea.<br>In User Experience Design, storyboards can be used for different purposes in different phases of design primarily during conceptualisation stages-<br>Strategy<br>Ideate - This phase of design is vital to come up with relevant ideas and the ideas must be well communicated to other stakeholders or other team members. In this phase of design storyboards can be a powerful tool to visualise the idea contextually and make others understand easily.<br>Research<br>Communicate the real story - Storyboards can be used to depict the real stories of users within their environment and context to communicate the research findings in their original forms.<br>Initial Prototyping<br>Paper prototyping - Physical or digital paper prototyping is also a form of storyboarding in which we draw/sketch the interfaces and put them in sequence or ask the users to do so. It helps us defining the navigational flow as per users expectations.<br>Read the full article here - <a href=https://www.linkedin.com/pulse/storyboarding-ux-design-amit-kumar-tiwari target=_blank>Storyboarding in UX Design<\/a><\/p><\/div>"
  },
  {
    "blogImage": "images/blog/IntrotoUX001.jpg",
    "blogTitle": "Introduction UX Design",
	"blogSubTitle": "It is design of an entity, orchestrated around the user, considering all the impacts and influences on the user's physical, mental and environmental settings. User Experience is even not limited to how users feel using a system, it extends to the persisted experience and impacts also after the use. It includes real experiences which are impactful for a long time, rather than considering only the perceptual experience.",
	"blogPostDate":"June 10, 2013",
	"blogPostTag":"Principles,Opinions",
    "blogDetailDescription":"<div class=post-img><img class=img-responsive alt=\"\" src=images/blog/IntrotoUX001.jpg style=\"margin:0 auto;box-shadow:0 0 5px #888\"><\/div><div class=post-content><p>In order to practice user experience process appropriately, we need to embrace some of the thumb rules set by the pioneers of this field. Focusing on a fine balance of user goals, business requirements and technological constraints begets a good and sustainable design.<br><br>UX vs UI User Interface Design involves the placement and detailed design of the widgets and elements on the screen. It includes the visual look and feel of the screen. In terms of process, it most often includes the interface design and a visual design using a static prototyping tool.<br><br>While the scope of user experience design is much broader and it spans over the complete development process of the system/product. It typically includes a vast research, modelling, requirement analysis, framework set up and many more activities to add. For a brief and clear distinction between UI &amp; UX in terms of activities involved in both of them, refer to <a href=http://uxisnotui.com target=_blank>uxisnotui.com<\/a>.<br><br>Interaction Design, HCI, Human Factors, Information Architecture &amp; so on... All these terms have a different meaning and have different application area. However, it is indeed true that there are overlapping areas among these domains, which creates the realm of User Experience.<\/p><\/div>"
  }  
]